#lang racket

;; clean stuff?
(require "punctuation.rkt")

;; put the data in here; just use ".rkt" as your file format

(define received-hash
  (hash 1 "道可道,非常道。名可名,非常名。無名天地之始;有名萬物之母。故常無欲,以觀其妙;常有欲,以觀其徼。此兩者,同出而異名,同謂之玄。玄之又玄,衆妙之門。"
        2 "天下皆知美之為美,斯惡已。皆知善之為善,斯不善已。故有無相生,難易相成,長短相較,高下相傾,音聲相和,前後相隨。是以聖人處無為之事,行不言之教;萬物作焉而不辭,生而不有。為而不恃,功成而弗居。夫唯弗居,是以不去。"
        3 "不尚賢,使民不爭;不貴難得之貨,使民不為盜;不見可欲,使心不亂。是以聖人之治,虛其心,實其腹,弱其志,強其骨。常使民無知無欲。使夫1知者不敢為也。為無為,則無不治。"
        4 "道沖而用之或不盈。淵兮似萬物之宗。挫其銳,解其紛,和其光,同其塵。湛兮似或存。吾不知誰之子,象帝之先。"
        5 "天地不仁,以萬物為芻狗;聖人不仁,以百姓為芻狗。天地之間,其猶橐籥乎?虛而不屈,動而愈出。多言數窮,不如守中。"
        11 "三十輻,共一轂,當其無,有車之用。埏埴以為器,當其無,有器之用。鑿戶牖以為室,當其無,有室之用。故有之以為利,無之以為用。"
        16 "致虛極,守靜篤。萬物並作,吾以觀復。夫物芸芸,各復歸其根。歸根曰靜,是謂復命。復命曰常,知常曰明。不知常,妄作凶。知常容,容乃公,公乃王,王乃天,天乃道,道乃久,沒身不殆。"
        20 "絕學無憂,唯之與阿,相去幾何?善之與惡,相去若何?人之所畏,不可不畏。荒兮其未央哉!衆人熙熙,如享太牢,如春登臺。我獨怕兮其未兆;如嬰兒之未孩;儽儽兮若無所歸。衆人皆有餘,而我獨若遺。我愚人之心也哉!沌沌兮,俗人昭昭,我獨若昏。俗人察察,我獨悶悶。澹兮其若海,飂兮若無止,衆人皆有以,而我獨頑似鄙。我獨異於人,而貴食母。"
        25 "有物混成,先天地生。寂兮寥兮,獨立不改,周行而不殆,可以為天下母。吾不知其名,字之曰道,強為之名曰大。大曰逝,逝曰遠,遠曰反。故道大,天大,地大,王亦大。域中有四大,而王居其一焉。人法地,地法天,天法道,道法自然。"
        38 "上德不德,是以有德;下德不失德,是以無德。上德無為而無以為;下德為之而有以為。上仁為之而無以為;上義為之而有以為。上禮為之而莫之應,則攘臂而扔之。故失道而後德,失德而後仁,失仁而後義,失義而後禮。夫禮者,忠信之薄,而亂之首。前識者,道之華,而愚之始。是以大丈夫處其厚,不居其薄;處其實,不居其華。故去彼取此。"
        42 "道生一,一生二,二生三,三生萬物。萬物負陰而抱陽,沖氣以為和。人之所惡,唯孤、寡、不穀,而王公以為稱。故物或損之而益,或益之而損。人之所教,我亦教之。強梁者不得其死,吾將以為教父。"
        48 "為學日益,為道日損。損之又損,以至於無為。無為而無不為。取天下常以無事,及其有事,不足以取天下。"
        56 "知者不言,言者不知。塞其兑,閉其門,挫其銳,解其分,和其光,同其塵,是謂玄同。故不可得而親,不可得而踈;不可得而利,不可得而害;不可得而貴,不可得而賤。故為天下貴。"))

(define mawangdui-jia-hash
  (hash 1 "道可道也,非恆道也。名可名也,非恆名也。無名萬物之始也;有名萬物之母也。□恆無欲也,以觀其眇;恆有欲也,以觀其所噭。兩者同出,異名同胃,玄之有玄,眾眇之□。"
        5 "天地不仁,以萬物為芻狗。聲人不仁,以百省□□狗。天地□間,□猶橐籥輿?虛而不淈,動而俞出。多聞數窮,不若守於中。"
        11 "卅□□□□□其無,□□之用。□然埴為器,當其無,有埴器□□□□□□,當其無,有□之用也。故有之以為利,無之以為用。"
        16 "至虛極也,守情表也。萬物旁作,吾以觀其復也。天物雲雲,各復歸於其□,□□。情,是胃復命。復命,常也;知常,明也;不知常,㠵。㠵作凶。知常容,容乃公,公乃王,王乃天,天乃道,□□□沕身不怠。"
        20 "□□□□,唯與訶,其相去幾何?美與惡,其相去何若?人之□□,亦不□□□□□□□□□□眾人巸巸,若鄉於大牢,而春登臺。我泊焉未佻,若□□□□;累呵如□□□□□皆有餘,我獨遺。我禺人之心也,蠢蠢呵。□□□□□□𦟲呵鬻人蔡蔡,我獨𨴽𨴽呵。忽呵其若□,望呵其若無所止。□□□□□□□□以悝。吾欲獨異於人,而貴食母。"
        25 "有物昆成,先天地生。繡呵繆呵,獨立□□□,可以為天地母。吾未知其名,字之曰道,吾強為之名曰大。□曰筮,筮曰□□□□□□天大,地大,王亦大。國中有四大,而王居一焉。人法地,□法□□法□□法□□。"
        38 "□□□□□□□□□□□□□□□□德。上德無□□無以為也。上仁為之□□以為也。上義為之而有以為也;上禮□□□□□□□□攘臂而乃之。故失道。失道矣而后德,失德而后仁,失仁而后義,□義而□□□□□□□□□□而亂之首也。□□□,道之華也,而愚之首也。是以大丈夫居其厚而不居其泊,居其實不居其華。故去皮取此。"
        42 ""
        48 ""
        56 ""))

(define mawangdui-yi-hash
  (hash 1 "道可道也,□□□□□□□□恆名也。無名萬物之始也;有名萬物之母也。故恆無欲也,□□□□;恆又欲也,以觀其所噭。兩者同出,異名同胃,玄之又玄,眾眇之門。"
        5 "天地不仁,以萬物為芻狗;聖人不仁,□百姓為芻狗。天地之閒,其猷橐籥輿?虛而不淈,動而俞出。多聞數窮,不若守於中。"
        11 "卅楅,同一轂,當其無,有車之用也。然埴而為器,當其無,有埴器之用也。戶牖,當其無,有室之用也。故有之以為利,無之以為用。"
        16 "至虛極也,守靜督也。萬物旁作,吾以觀其復也。天物𥘟𥘟,各復歸於其根,曰靜。靜,是胃復命。復命,常也;知常,明也;不知常,芒;芒,作凶;知常容,容乃公,公乃王,□□天,天乃道,道乃沒身不殆。"
        20 "絕學無憂,唯與呵,其相去幾何?美與亞,其相去何若?人之所畏,亦不可以不畏人。朢呵其未央才!眾人熙熙。若鄉於大牢。而春登臺。我博焉未垗,若嬰兒未咳;纍呵佁無所歸。眾人皆又余,我愚人之心也,湷湷呵。鬻人昭昭,我獨若𨴽呵。鬻人察察,我獨閩閩呵,忽呵其若海,朢呵若無所止。眾人皆有以,我獨門元以鄙。吾欲獨異於人,而貴食母。"
        25 "有物昆成,先天地生。蕭呵漻呵,獨立而不改,可以為天地母。吾未知其名也,字之曰道,吾強為之名曰大。大曰筮,筮曰遠,遠曰反。道大,天大,地大,王亦大。國中有四大,而王居一焉。人法地,地法天,天法道,道法自然。"
        38 "上德不德,是以有德;下德不失德,是以無德。上德無為而無以為也;上仁為之而無以為也。上○為之而有以為也;上禮為之而莫之應也,則攘臂而乃之。故失道而后德,失德而句仁,失仁而句義∠,失義而句禮。夫禮者,忠信之泊也而亂之首也。前識者,道之華也,而愚之首也。是以大丈夫居□□□居其泊;居其實而不居其華。故去罷而取此。"
        42 "道生一,一生二,二生三,三生□□□□□□□□□□□以為和。人之所亞,唯孤、寡、不穀,而王公以自□□□□□□□云云之而益。□□□□□□□□□□□□□□□□吾將以□□父。"
        48 "為學者日益,聞道者日云。云之有云,以至於無□□□□□□□□□□。取天下恆無事,及其有事也,□□足以取天□□。"
        56 "知者弗言,言者弗知。塞其兌,閉其門,和其光,同其塵,銼其兌,而解其紛,是胃玄同。故不可得而親也,亦□□得而□□□得而○利,□□□得而害;不可得而貴,亦不可得而賤。故為天下貴。"))

(define guo-dian-hash
  (hash 1 ""
        5 ""
        11 ""
        16 ""
        20 ""
        25 ""
        38 ""
        42 ""
        48 ""
        56 ""))

(define he-shang-gong-hash
  (hash 1 ""
        5 ""
        11 ""
        16 ""
        20 ""
        25 ""
        38 ""
        42 ""
        48 ""
        56 ""))

(define wang-bi-hash
  (hash 1 ""
        5 ""
        11 ""
        16 ""
        20 ""
        25 ""
        38 ""
        42 ""
        48 ""
        56 ""))

(define xihan-hash
  (hash  1 "道可道,非恒道殹(也);名可命,非恒名也。無名,萬物之始也;有名,萬物之母也。【一二四】故恒無欲以觀其眇(妙),恒有欲以觀其所僥(徼)。此兩者同出,異名同謂。玄之有(又)【一二五】玄之,眾眇(妙)之門。【一二六】"
        5 "天地不仁,以萬物為芻狗;聖人不仁,以百姓為芻狗。天地之閒,其猶橐籥【一三六】虖(乎)?虛而不屈,動而揄(愈)出。多聞數窮,不若守於中。【一三七】"
        11 "卅輻同一轂,當其無,有車之用也;挻殖(埴)器,當其無,有殖(埴)器之用也;鑿戶牖,【一四八】當其無,有室之用也。故有之以為利,無之以為用。【一四九】"
        16 "古之為士者,微眇(妙)玄達,深不可識。夫唯不可識,故強為之頌(容)曰:就(蹴)虖(乎)其如【一五九】冬涉水,猶虖(乎)其如畏四鄰,嚴(儼)虖(乎)其如客,渙虖(乎)其如冰之澤(釋),(敦)虖(乎)其如樸,沌【一六〇】虖(乎)其如濁,廣(曠)虖(乎)其如浴(谷)。孰能濁以靜之?徐清。孰能安以動之?徐生。抱此道【一六一】者不欲盈,夫唯不盈,是以能敝不成。【一六二】"
        20 "絕學無憂。唯與何(訶),其相去幾何?美與惡,其相去何若?人之所畏,不可以不【一七一】不畏人。芒(荒)虖(乎),未央哉!眾人巸巸(熙熙),若鄉(享)大(太)牢而萅(春)登臺。我𥙃(泊)旖(兮)未佻(兆),若嬰兒之未【一七二】䀭(孩)。絫旖(兮),台(似)無所歸。眾人皆有餘,我蜀(獨)若遺(匱)。我愚人之心也,屯屯(沌沌)虖(乎)!猷(俗)人昭昭,我【一七三】蜀(獨)若昏;猷(俗)人計計(察察),我獨昏昏。沒(忽)旖(兮),其如晦;芒(恍)旖(兮),其無所止。眾人皆有以,而我獨【一七四】抏(頑)以鄙。我欲獨異於人,而唯貴食母。【一七五】"
        25 "炊(企)者不立,自見者不明,自視(是)者不章(彰),自發(伐)者無功,矜者不長。其在道也,斜(餘)【一八五】食叕(贅)行,物或惡之,故有欲者弗居。【一八六】"
        38 "上德不德,是以有德。下德不失德,是以無德。上德無為而無以為,下德[為]【一】之而無以為。上仁為之而無以為,上義為之而有以為。上禮為之而莫之【二】應,則攘臂而乃(扔)之。故失道而後德,失德而後仁,失仁而後義,失義而後禮。【三】夫禮,忠信之淺而亂之首也。前識者,道之華而愚之首也。是以大丈夫居【四】其厚,不居其薄,居其實,不居其華。故去被(彼)取此。【五】"
        42 "道生一,一生二,二生三,三生萬物。萬物負陰抱陽,中(沖)氣以為和。人之所惡,唯孤、寡、不穀,【一六】而王公以自名也。是故物或損而益,或益而損。人之所教,亦我而教人。故【一七】強粱(梁)者不得死,吾將以為學(教)父。【一八】"
        48 "為學者日益,為道者日損。[損]之有(又)損之,至於無[為。無為無不為。取天下者恒以]【二九】無事,及其有事,有(又)不足以取天下。【三〇】"
        56 "智(知)者弗言,言者弗智(知)。塞其脫(兌),閉其門,和其光,同其畛(塵),挫其兌(銳),解其紛,是謂玄【五一】同。故不可得而親,亦不可得而疏;不可得而利,亦不可得而害;不可得而【五二】貴,亦不可得而賤。故為天下貴。【五三】"))


;; remove everything in between 【】 or in between (), remove [, ]

(define all-raw
  (hash "received" received-hash
        "mawangdui-jia" mawangdui-jia-hash
        "mawangdui-yi" mawangdui-yi-hash
        "heshanggong" he-shang-gong-hash
        "wangbi" wang-bi-hash))


 ;; clean the text
(define (clean-punctuation cur-hash)
  (foldr (λ(key ht) (hash-update ht key remove-punctuation)) cur-hash (hash-keys cur-hash)))

(define (clean-square cur-hash)
  (foldr (λ(key ht) (hash-update ht key sub-square)) cur-hash (hash-keys cur-hash)))

(define (update cur-hash proc)
  (foldr (λ(key ht) (hash-update ht key proc)) cur-hash (hash-keys cur-hash)))


;; apply a list of cleaning operations to the text
(define (clean-all operations nested-hash)
  (cond
    [(empty? operations) nested-hash]
    [else (foldr (λ(key ht) (hash-update ht key (first operations))) (clean-all (rest operations) nested-hash) (hash-keys nested-hash))]))

(define update-operations
  (list clean-punctuation
        clean-square
        (λ(ht) (update ht (λ(v) (regexp-match #rx"【.】" v))))))

(define DDJ (clean-all (list clean-punctuation clean-square) all-raw))

(define (source version chapter)
  (hash-ref (hash-ref DDJ version) chapter))

(provide DDJ)
(provide source)

;;(clean-square received-hash)

;; use Regex for cleaning
 
(define teststring "橐籥【一三六】虖(乎)")
(define test2 "橐籥【一三六】虖(橐籥【一三六】虖(橐籥【一三六】虖(")

(define chinese-brackets (regexp "【(.+)】"))
(define parentheses (regexp "\\((.+)\\)"))
;(define punctuation (regexp "。|,|;|、"))
(define punctuation (regexp "。"))

;(regexp-match rex teststring)
;(regexp-replace chinese-brackets teststring "")

#|(regexp-replace parentheses 
                (regexp-replace chinese-brackets (hash-ref xihan-hash 1) "")
                "")|#

(define (clean s reg-pairs)
  (cond
    [(empty? reg-pairs) s]
    [else (clean (regexp-replace* (regexp (car (first reg-pairs))) s (cdr (first reg-pairs)))
                 (rest reg-pairs))]))

(define regular-pairs
  (list (cons "【(.+)】" "")
        (cons "\\((.+)\\)" "")
        (cons "。|,|;|、" "")))

(clean (hash-ref received-hash 1) regular-pairs)

;(。|,|;|、)
